app/controllers/api/v1/recipes_controller.rb

  def index
    recipe = Recipe.all.order(created_at: :desc)
---
SELECT "recipes".* FROM "recipes" ORDER BY "recipes"."created_at" DESC

  def create
    recipe = Recipe.create(recipe_params)
---
INSERT INTO "recipes" ("name", "ingredients", "instruction", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def destroy
    recipe&.destroy
---
DELETE FROM "recipes" WHERE "recipes"."id" = $1  [["id", 9]]

  def recipe
    @recipe ||= Recipe.find(params[:id])
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]